ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/MSS_IOMUX_IOMUX_53100000h.xml
	<bitfield id="INP_INV_SEL" width="1" begin="20" end="20" resetval="0x0" description="Select Value for chosing inverted version of PAD input for chip:0 : Non Inverted1 : Inverted" range="20" rwaccess="R/W"/>
	<bitfield id="QUAL_SEL" width="2" begin="19" end="18" resetval="0x0" description="Select Value for chosing input qualifer type for PAD.00 : Sync, 01 : 3 Sample qual 10 : 6 Samples qual 11 : Async" range="19:18" rwaccess="R/W"/>
	<bitfield id="GPIO_SEL" width="2" begin="17" end="16" resetval="0x0" description="R5F CPU ownership select for GPIO.0 : GPO0, 1 :GPO1,2 : GPO2, 3:GPO3" range="17:16" rwaccess="R/W"/>
	<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew Rate Control :0 : higher slew rate.1:Lower slew rate." range="10" rwaccess="R/W"/>
	<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x0" description="Internal Pull Resistor Direction Control bit0:Pull-down Resistor1:Pull-up Resistor" range="9" rwaccess="R/W"/>
	<bitfield id="PI" width="1" begin="8" end="8" resetval="0x1" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x1" description="Active Low Output Override" range="7" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x1" description="Output Override Control bit (Active Low)This bit provides a software override for the default OE_N/GZ hardware control.0:Enable pad input override1:Disable pad input override" range="6" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH)" range="5" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH) Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="R/W"/>
	<bitfield id="FUNC_SEL" width="4" begin="3" end="0" resetval="0x7" description="Function select" range="3:0" rwaccess="R/W"/>
	</register><register id="IOMUX_EPWM7_B_CFG_REG" acronym="IOMUX_EPWM7_B_CFG_REG" offset="232" width="32" description="EPWM7_B IO config register.">
		<bitfield id="SAFETY_OVERRIDE_SEL" width="1" begin="22" end="22" resetval="0x0" description="mux Select Value to choose between Actual IO pad input and Safety override mux output1 Safety override mux output is selected0 Actual IO pad input is selected" range="22" rwaccess="R/W"/>
	<bitfield id="ICSSM_GPIO_SEL" width="1" begin="21" end="21" resetval="0x0" description="mux Select Value to choose between ICSSM_GPIO and normal GPIO 1 ICSSM_GPIO is selected0 Normal GPIO is selected" range="21" rwaccess="R/W"/>
	<bitfield id="INP_INV_SEL" width="1" begin="20" end="20" resetval="0x0" description="Select Value for chosing inverted version of PAD input for chip:0 : Non Inverted1 : Inverted" range="20" rwaccess="R/W"/>
	<bitfield id="QUAL_SEL" width="2" begin="19" end="18" resetval="0x0" description="Select Value for chosing input qualifer type for PAD.00 : Sync, 01 : 3 Sample qual 10 : 6 Samples qual 11 : Async" range="19:18" rwaccess="R/W"/>
	<bitfield id="GPIO_SEL" width="2" begin="17" end="16" resetval="0x0" description="R5F CPU ownership select for GPIO.0 : GPO0, 1 :GPO1,2 : GPO2, 3:GPO3" range="17:16" rwaccess="R/W"/>
	<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew Rate Control :0 : higher slew rate.1:Lower slew rate." range="10" rwaccess="R/W"/>
	<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x0" description="Internal Pull Resistor Direction Control bit0:Pull-down Resistor1:Pull-up Resistor" range="9" rwaccess="R/W"/>
	<bitfield id="PI" width="1" begin="8" end="8" resetval="0x1" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x1" description="Active Low Output Override" range="7" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x1" description="Output Override Control bit (Active Low)This bit provides a software override for the default OE_N/GZ hardware control.0:Enable pad input override1:Disable pad input override" range="6" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH)" range="5" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH) Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="R/W"/>
	<bitfield id="FUNC_SEL" width="4" begin="3" end="0" resetval="0x7" description="Function select" range="3:0" rwaccess="R/W"/>
	</register><register id="IOMUX_EPWM8_A_CFG_REG" acronym="IOMUX_EPWM8_A_CFG_REG" offset="236" width="32" description="EPWM8_A IO config register.">
		<bitfield id="SAFETY_OVERRIDE_SEL" width="1" begin="22" end="22" resetval="0x0" description="mux Select Value to choose between Actual IO pad input and Safety override mux output1 Safety override mux output is selected0 Actual IO pad input is selected" range="22" rwaccess="R/W"/>
	<bitfield id="ICSSM_GPIO_SEL" width="1" begin="21" end="21" resetval="0x0" description="mux Select Value to choose between ICSSM_GPIO and normal GPIO 1 ICSSM_GPIO is selected0 Normal GPIO is selected" range="21" rwaccess="R/W"/>
	<bitfield id="INP_INV_SEL" width="1" begin="20" end="20" resetval="0x0" description="Select Value for chosing inverted version of PAD input for chip:0 : Non Inverted1 : Inverted" range="20" rwaccess="R/W"/>
	<bitfield id="QUAL_SEL" width="2" begin="19" end="18" resetval="0x0" description="Select Value for chosing input qualifer type for PAD.00 : Sync, 01 : 3 Sample qual 10 : 6 Samples qual 11 : Async" range="19:18" rwaccess="R/W"/>
	<bitfield id="GPIO_SEL" width="2" begin="17" end="16" resetval="0x0" description="R5F CPU ownership select for GPIO.0 : GPO0, 1 :GPO1,2 : GPO2, 3:GPO3" range="17:16" rwaccess="R/W"/>
	<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew Rate Control :0 : higher slew rate.1:Lower slew rate." range="10" rwaccess="R/W"/>
	<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x0" description="Internal Pull Resistor Direction Control bit0:Pull-down Resistor1:Pull-up Resistor" range="9" rwaccess="R/W"/>
	<bitfield id="PI" width="1" begin="8" end="8" resetval="0x1" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x1" description="Active Low Output Override" range="7" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x1" description="Output Override Control bit (Active Low)This bit provides a software override for the default OE_N/GZ hardware control.0:Enable pad input override1:Disable pad input override" range="6" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH)" range="5" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH) Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="R/W"/>
	<bitfield id="FUNC_SEL" width="4" begin="3" end="0" resetval="0x7" description="Function select" range="3:0" rwaccess="R/W"/>
	</register><register id="IOMUX_EPWM8_B_CFG_REG" acronym="IOMUX_EPWM8_B_CFG_REG" offset="240" width="32" description="EPWM8_B IO config register.">
		<bitfield id="SAFETY_OVERRIDE_SEL" width="1" begin="22" end="22" resetval="0x0" description="mux Select Value to choose between Actual IO pad input and Safety override mux output1 Safety override mux output is selected0 Actual IO pad input is selected" range="22" rwaccess="R/W"/>
	<bitfield id="ICSSM_GPIO_SEL" width="1" begin="21" end="21" resetval="0x0" description="mux Select Value to choose between ICSSM_GPIO and normal GPIO 1 ICSSM_GPIO is selected0 Normal GPIO is selected" range="21" rwaccess="R/W"/>
	<bitfield id="INP_INV_SEL" width="1" begin="20" end="20" resetval="0x0" description="Select Value for chosing inverted version of PAD input for chip:0 : Non Inverted1 : Inverted" range="20" rwaccess="R/W"/>
	<bitfield id="QUAL_SEL" width="2" begin="19" end="18" resetval="0x0" description="Select Value for chosing input qualifer type for PAD.00 : Sync, 01 : 3 Sample qual 10 : 6 Samples qual 11 : Async" range="19:18" rwaccess="R/W"/>
	<bitfield id="GPIO_SEL" width="2" begin="17" end="16" resetval="0x0" description="R5F CPU ownership select for GPIO.0 : GPO0, 1 :GPO1,2 : GPO2, 3:GPO3" range="17:16" rwaccess="R/W"/>
	<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew Rate Control :0 : higher slew rate.1:Lower slew rate." range="10" rwaccess="R/W"/>
	<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x0" description="Internal Pull Resistor Direction Control bit0:Pull-down Resistor1:Pull-up Resistor" range="9" rwaccess="R/W"/>
	<bitfield id="PI" width="1" begin="8" end="8" resetval="0x1" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x1" description="Active Low Output Override" range="7" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x1" description="Output Override Control bit (Active Low)This bit provides a software override for the default OE_N/GZ hardware control.0:Enable pad input override1:Disable pad input override" range="6" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH)" range="5" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH) Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="R/W"/>
	<bitfield id="FUNC_SEL" width="4" begin="3" end="0" resetval="0x7" description="Function select" range="3:0" rwaccess="R/W"/>
	</register><register id="IOMUX_EPWM9_A_CFG_REG" acronym="IOMUX_EPWM9_A_CFG_REG" offset="244" width="32" description="EPWM9_A IO config register.">
		<bitfield id="SAFETY_OVERRIDE_SEL" width="1" begin="22" end="22" resetval="0x0" description="mux Select Value to choose between Actual IO pad input and Safety override mux output1 Safety override mux output is selected0 Actual IO pad input is selected" range="22" rwaccess="R/W"/>
	<bitfield id="ICSSM_GPIO_SEL" width="1" begin="21" end="21" resetval="0x0" description="mux Select Value to choose between ICSSM_GPIO and normal GPIO 1 ICSSM_GPIO is selected0 Normal GPIO is selected" range="21" rwaccess="R/W"/>
	<bitfield id="INP_INV_SEL" width="1" begin="20" end="20" resetval="0x0" description="Select Value for chosing inverted version of PAD input for chip:0 : Non Inverted1 : Inverted" range="20" rwaccess="R/W"/>
	<bitfield id="QUAL_SEL" width="2" begin="19" end="18" resetval="0x0" description="Select Value for chosing input qualifer type for PAD.00 : Sync, 01 : 3 Sample qual 10 : 6 Samples qual 11 : Async" range="19:18" rwaccess="R/W"/>
	<bitfield id="GPIO_SEL" width="2" begin="17" end="16" resetval="0x0" description="R5F CPU ownership select for GPIO.0 : GPO0, 1 :GPO1,2 : GPO2, 3:GPO3" range="17:16" rwaccess="R/W"/>
	<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew Rate Control :0 : higher slew rate.1:Lower slew rate." range="10" rwaccess="R/W"/>
	<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x0" description="Internal Pull Resistor Direction Control bit0:Pull-down Resistor1:Pull-up Resistor" range="9" rwaccess="R/W"/>
	<bitfield id="PI" width="1" begin="8" end="8" resetval="0x1" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x1" description="Active Low Output Override" range="7" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x1" description="Output Override Control bit (Active Low)This bit provides a software override for the default OE_N/GZ hardware control.0:Enable pad input override1:Disable pad input override" range="6" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH)" range="5" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH) Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="R/W"/>
	<bitfield id="FUNC_SEL" width="4" begin="3" end="0" resetval="0x7" description="Function select" range="3:0" rwaccess="R/W"/>
	</register><register id="IOMUX_EPWM9_B_CFG_REG" acronym="IOMUX_EPWM9_B_CFG_REG" offset="248" width="32" description="EPWM9_B IO config register.">
		<bitfield id="SAFETY_OVERRIDE_SEL" width="1" begin="22" end="22" resetval="0x0" description="mux Select Value to choose between Actual IO pad input and Safety override mux output1 Safety override mux output is selected0 Actual IO pad input is selected" range="22" rwaccess="R/W"/>
	<bitfield id="ICSSM_GPIO_SEL" width="1" begin="21" end="21" resetval="0x0" description="mux Select Value to choose between ICSSM_GPIO and normal GPIO 1 ICSSM_GPIO is selected0 Normal GPIO is selected" range="21" rwaccess="R/W"/>
	<bitfield id="INP_INV_SEL" width="1" begin="20" end="20" resetval="0x0" description="Select Value for chosing inverted version of PAD input for chip:0 : Non Inverted1 : Inverted" range="20" rwaccess="R/W"/>
	<bitfield id="QUAL_SEL" width="2" begin="19" end="18" resetval="0x0" description="Select Value for chosing input qualifer type for PAD.00 : Sync, 01 : 3 Sample qual 10 : 6 Samples qual 11 : Async" range="19:18" rwaccess="R/W"/>
	<bitfield id="GPIO_SEL" width="2" begin="17" end="16" resetval="0x0" description="R5F CPU ownership select for GPIO.0 : GPO0, 1 :GPO1,2 : GPO2, 3:GPO3" range="17:16" rwaccess="R/W"/>
	<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew Rate Control :0 : higher slew rate.1:Lower slew rate." range="10" rwaccess="R/W"/>
	<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x0" description="Internal Pull Resistor Direction Control bit0:Pull-down Resistor1:Pull-up Resistor" range="9" rwaccess="R/W"/>
	<bitfield id="PI" width="1" begin="8" end="8" resetval="0x1" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x1" description="Active Low Output Override" range="7" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x1" description="Output Override Control bit (Active Low)This bit provides a software override for the default OE_N/GZ hardware control.0:Enable pad input override1:Disable pad input override" range="6" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH)" range="5" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH) Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="R/W"/>
	<bitfield id="FUNC_SEL" width="4" begin="3" end="0" resetval="0x7" description="Function select" range="3:0" rwaccess="R/W"/>
	</register><register id="IOMUX_EPWM10_A_CFG_REG" acronym="IOMUX_EPWM10_A_CFG_REG" offset="252" width="32" description="EPWM10_A IO config register.">
		<bitfield id="SAFETY_OVERRIDE_SEL" width="1" begin="22" end="22" resetval="0x0" description="mux Select Value to choose between Actual IO pad input and Safety override mux output1 Safety override mux output is selected0 Actual IO pad input is selected" range="22" rwaccess="R/W"/>
	<bitfield id="ICSSM_GPIO_SEL" width="1" begin="21" end="21" resetval="0x0" description="mux Select Value to choose between ICSSM_GPIO and normal GPIO 1 ICSSM_GPIO is selected0 Normal GPIO is selected" range="21" rwaccess="R/W"/>
	<bitfield id="INP_INV_SEL" width="1" begin="20" end="20" resetval="0x0" description="Select Value for chosing inverted version of PAD input for chip:0 : Non Inverted1 : Inverted" range="20" rwaccess="R/W"/>
	<bitfield id="QUAL_SEL" width="2" begin="19" end="18" resetval="0x0" description="Select Value for chosing input qualifer type for PAD.00 : Sync, 01 : 3 Sample qual 10 : 6 Samples qual 11 : Async" range="19:18" rwaccess="R/W"/>
	<bitfield id="GPIO_SEL" width="2" begin="17" end="16" resetval="0x0" description="R5F CPU ownership select for GPIO.0 : GPO0, 1 :GPO1,2 : GPO2, 3:GPO3" range="17:16" rwaccess="R/W"/>
	<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew Rate Control :0 : higher slew rate.1:Lower slew rate." range="10" rwaccess="R/W"/>
	<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x0" description="Internal Pull Resistor Direction Control bit0:Pull-down Resistor1:Pull-up Resistor" range="9" rwaccess="R/W"/>
	<bitfield id="PI" width="1" begin="8" end="8" resetval="0x1" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x1" description="Active Low Output Override" range="7" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x1" description="Output Override Control bit (Active Low)This bit provides a software override for the default OE_N/GZ hardware control.0:Enable pad input override1:Disable pad input override" range="6" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH)" range="5" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH) Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="R/W"/>
	<bitfield id="FUNC_SEL" width="4" begin="3" end="0" resetval="0x7" description="Function select" range="3:0" rwaccess="R/W"/>
	</register><register id="IOMUX_EPWM10_B_CFG_REG" acronym="IOMUX_EPWM10_B_CFG_REG" offset="256" width="32" description="EPWM10_B IO config register.">
		<bitfield id="SAFETY_OVERRIDE_SEL" width="1" begin="22" end="22" resetval="0x0" description="mux Select Value to choose between Actual IO pad input and Safety override mux output1 Safety override mux output is selected0 Actual IO pad input is selected" range="22" rwaccess="R/W"/>
	<bitfield id="ICSSM_GPIO_SEL" width="1" begin="21" end="21" resetval="0x0" description="mux Select Value to choose between ICSSM_GPIO and normal GPIO 1 ICSSM_GPIO is selected0 Normal GPIO is selected" range="21" rwaccess="R/W"/>
	<bitfield id="INP_INV_SEL" width="1" begin="20" end="20" resetval="0x0" description="Select Value for chosing inverted version of PAD input for chip:0 : Non Inverted1 : Inverted" range="20" rwaccess="R/W"/>
	<bitfield id="QUAL_SEL" width="2" begin="19" end="18" resetval="0x0" description="Select Value for chosing input qualifer type for PAD.00 : Sync, 01 : 3 Sample qual 10 : 6 Samples qual 11 : Async" range="19:18" rwaccess="R/W"/>
	<bitfield id="GPIO_SEL" width="2" begin="17" end="16" resetval="0x0" description="R5F CPU ownership select for GPIO.0 : GPO0, 1 :GPO1,2 : GPO2, 3:GPO3" range="17:16" rwaccess="R/W"/>
	<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew Rate Control :0 : higher slew rate.1:Lower slew rate." range="10" rwaccess="R/W"/>
	<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x0" description="Internal Pull Resistor Direction Control bit0:Pull-down Resistor1:Pull-up Resistor" range="9" rwaccess="R/W"/>
	<bitfield id="PI" width="1" begin="8" end="8" resetval="0x1" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x1" description="Active Low Output Override" range="7" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x1" description="Output Override Control bit (Active Low)This bit provides a software override for the default OE_N/GZ hardware control.0:Enable pad input override1:Disable pad input override" range="6" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH)" range="5" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH) Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="R/W"/>
	<bitfield id="FUNC_SEL" width="4" begin="3" end="0" resetval="0x7" description="Function select" range="3:0" rwaccess="R/W"/>
	</register><register id="IOMUX_EPWM11_A_CFG_REG" acronym="IOMUX_EPWM11_A_CFG_REG" offset="260" width="32" description="EPWM11_A IO config register.">
		<bitfield id="SAFETY_OVERRIDE_SEL" width="1" begin="22" end="22" resetval="0x0" description="mux Select Value to choose between Actual IO pad input and Safety override mux output1 Safety override mux output is selected0 Actual IO pad input is selected" range="22" rwaccess="R/W"/>
	<bitfield id="ICSSM_GPIO_SEL" width="1" begin="21" end="21" resetval="0x0" description="mux Select Value to choose between ICSSM_GPIO and normal GPIO 1 ICSSM_GPIO is selected0 Normal GPIO is selected" range="21" rwaccess="R/W"/>
	<bitfield id="INP_INV_SEL" width="1" begin="20" end="20" resetval="0x0" description="Select Value for chosing inverted version of PAD input for chip:0 : Non Inverted1 : Inverted" range="20" rwaccess="R/W"/>
	<bitfield id="QUAL_SEL" width="2" begin="19" end="18" resetval="0x0" description="Select Value for chosing input qualifer type for PAD.00 : Sync, 01 : 3 Sample qual 10 : 6 Samples qual 11 : Async" range="19:18" rwaccess="R/W"/>
	<bitfield id="GPIO_SEL" width="2" begin="17" end="16" resetval="0x0" description="R5F CPU ownership select for GPIO.0 : GPO0, 1 :GPO1,2 : GPO2, 3:GPO3" range="17:16" rwaccess="R/W"/>
