ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/MSS_IOMUX_IOMUX_53100000h.xml
	<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH)" range="5" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH) Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="R/W"/>
	<bitfield id="FUNC_SEL" width="4" begin="3" end="0" resetval="0x0" description="Function select" range="3:0" rwaccess="R/W"/>
	</register><register id="IOMUX_WARMRSTN_CFG_REG" acronym="IOMUX_WARMRSTN_CFG_REG" offset="556" width="32" description="WARMRSTn IO config register.">
		<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew Rate Control :0 : higher slew rate.1:Lower slew rate." range="10" rwaccess="R/W"/>
	<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x0" description="Internal Pull Resistor Direction Control bit0:Pull-down Resistor1:Pull-up Resistor" range="9" rwaccess="R/W"/>
	<bitfield id="PI" width="1" begin="8" end="8" resetval="0x1" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x0" description="Active Low Output Override" range="7" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x0" description="Output Override Control bit (Active Low)This bit provides a software override for the default OE_N/GZ hardware control.0:Enable pad input override1:Disable pad input override" range="6" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x0" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH)" range="5" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH) Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="R/W"/>
	</register><register id="IOMUX_SAFETY_ERRORN_CFG_REG" acronym="IOMUX_SAFETY_ERRORN_CFG_REG" offset="560" width="32" description="SAFETY_ERRORn IO config register.">
		<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew Rate Control :0 : higher slew rate.1:Lower slew rate." range="10" rwaccess="R/W"/>
	<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x0" description="Internal Pull Resistor Direction Control bit0:Pull-down Resistor1:Pull-up Resistor" range="9" rwaccess="R/W"/>
	<bitfield id="PI" width="1" begin="8" end="8" resetval="0x0" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x0" description="Active Low Output Override" range="7" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x0" description="Output Override Control bit (Active Low)This bit provides a software override for the default OE_N/GZ hardware control.0:Enable pad input override1:Disable pad input override" range="6" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x0" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH)" range="5" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH) Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="R/W"/>
	</register><register id="IOMUX_TDI_CFG_REG" acronym="IOMUX_TDI_CFG_REG" offset="564" width="32" description="TDI IO config register.">
		<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew Rate Control :0 : higher slew rate.1:Lower slew rate." range="10" rwaccess="R/W"/>
	<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x1" description="Internal Pull Resistor Direction Control bit0:Pull-down Resistor1:Pull-up Resistor" range="9" rwaccess="R/W"/>
	<bitfield id="PI" width="1" begin="8" end="8" resetval="0x0" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x1" description="Active Low Output Override" range="7" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x1" description="Output Override Control bit (Active Low)This bit provides a software override for the default OE_N/GZ hardware control.0:Enable pad input override1:Disable pad input override" range="6" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x0" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH)" range="5" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH) Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="R/W"/>
	</register><register id="IOMUX_TDO_CFG_REG" acronym="IOMUX_TDO_CFG_REG" offset="568" width="32" description="TDO IO config register.">
		<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew Rate Control :0 : higher slew rate.1:Lower slew rate." range="10" rwaccess="R/W"/>
	<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x1" description="Internal Pull Resistor Direction Control bit0:Pull-down Resistor1:Pull-up Resistor" range="9" rwaccess="R/W"/>
	<bitfield id="PI" width="1" begin="8" end="8" resetval="0x0" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x0" description="Active Low Output Override" range="7" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x0" description="Output Override Control bit (Active Low)This bit provides a software override for the default OE_N/GZ hardware control.0:Enable pad input override1:Disable pad input override" range="6" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH)" range="5" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH) Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="R/W"/>
	</register><register id="IOMUX_TMS_CFG_REG" acronym="IOMUX_TMS_CFG_REG" offset="572" width="32" description="TMS IO config register.">
		<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew Rate Control :0 : higher slew rate.1:Lower slew rate." range="10" rwaccess="R/W"/>
	<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x1" description="Internal Pull Resistor Direction Control bit0:Pull-down Resistor1:Pull-up Resistor" range="9" rwaccess="R/W"/>
	<bitfield id="PI" width="1" begin="8" end="8" resetval="0x0" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x0" description="Active Low Output Override" range="7" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x0" description="Output Override Control bit (Active Low)This bit provides a software override for the default OE_N/GZ hardware control.0:Enable pad input override1:Disable pad input override" range="6" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x0" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH)" range="5" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH) Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="R/W"/>
	</register><register id="IOMUX_TCK_CFG_REG" acronym="IOMUX_TCK_CFG_REG" offset="576" width="32" description="TCK IO config register.">
		<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x0" description="IO Slew Rate Control :0 : higher slew rate.1:Lower slew rate." range="10" rwaccess="R/W"/>
	<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x1" description="Internal Pull Resistor Direction Control bit0:Pull-down Resistor1:Pull-up Resistor" range="9" rwaccess="R/W"/>
	<bitfield id="PI" width="1" begin="8" end="8" resetval="0x0" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x0" description="Active Low Output Override" range="7" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x0" description="Output Override Control bit (Active Low)This bit provides a software override for the default OE_N/GZ hardware control.0:Enable pad input override1:Disable pad input override" range="6" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x0" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH)" range="5" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH) Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="R/W"/>
	</register><register id="IOMUX_OSPI0_CLKLB_CFG_REG" acronym="IOMUX_OSPI0_CLKLB_CFG_REG" offset="580" width="32" description="OSPI0_CLKLB IO config register.">
		<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew Rate Control :0 : higher slew rate.1:Lower slew rate." range="10" rwaccess="R/W"/>
	<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x0" description="Internal Pull Resistor Direction Control bit0:Pull-down Resistor1:Pull-up Resistor" range="9" rwaccess="R/W"/>
	<bitfield id="PI" width="1" begin="8" end="8" resetval="0x1" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x1" description="Active Low Output Override" range="7" rwaccess="R/W"/>
	<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x1" description="Output Override Control bit (Active Low)This bit provides a software override for the default OE_N/GZ hardware control.0:Enable pad input override1:Disable pad input override" range="6" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH)" range="5" rwaccess="R/W"/>
	<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Input Override (Active Low)0:Override pad input signal to 0 (LOW)1:Override pad input signal to 1 (HIGH) Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="R/W"/>
	</register><register id="IOMUX_QUAL_GRP_0_CFG_REG" acronym="IOMUX_QUAL_GRP_0_CFG_REG" offset="584" width="32" description="QUAL_GRP_0 config register.">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7:0" rwaccess="R/W"/>
	</register><register id="IOMUX_QUAL_GRP_1_CFG_REG" acronym="IOMUX_QUAL_GRP_1_CFG_REG" offset="588" width="32" description="QUAL_GRP_1 config register.">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7:0" rwaccess="R/W"/>
	</register><register id="IOMUX_QUAL_GRP_2_CFG_REG" acronym="IOMUX_QUAL_GRP_2_CFG_REG" offset="592" width="32" description="QUAL_GRP_2 config register.">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7:0" rwaccess="R/W"/>
	</register><register id="IOMUX_QUAL_GRP_3_CFG_REG" acronym="IOMUX_QUAL_GRP_3_CFG_REG" offset="596" width="32" description="QUAL_GRP_3 config register.">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7:0" rwaccess="R/W"/>
	</register><register id="IOMUX_QUAL_GRP_4_CFG_REG" acronym="IOMUX_QUAL_GRP_4_CFG_REG" offset="600" width="32" description="QUAL_GRP_4 config register.">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7:0" rwaccess="R/W"/>
	</register><register id="IOMUX_QUAL_GRP_5_CFG_REG" acronym="IOMUX_QUAL_GRP_5_CFG_REG" offset="604" width="32" description="QUAL_GRP_5 config register.">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7:0" rwaccess="R/W"/>
	</register><register id="IOMUX_QUAL_GRP_6_CFG_REG" acronym="IOMUX_QUAL_GRP_6_CFG_REG" offset="608" width="32" description="QUAL_GRP_6 config register.">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7:0" rwaccess="R/W"/>
	</register><register id="IOMUX_QUAL_GRP_7_CFG_REG" acronym="IOMUX_QUAL_GRP_7_CFG_REG" offset="612" width="32" description="QUAL_GRP_7 config register.">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7:0" rwaccess="R/W"/>
	</register><register id="IOMUX_QUAL_GRP_8_CFG_REG" acronym="IOMUX_QUAL_GRP_8_CFG_REG" offset="616" width="32" description="QUAL_GRP_8 config register.">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7:0" rwaccess="R/W"/>
	</register><register id="IOMUX_QUAL_GRP_9_CFG_REG" acronym="IOMUX_QUAL_GRP_9_CFG_REG" offset="620" width="32" description="QUAL_GRP_9 config register.">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7:0" rwaccess="R/W"/>
	</register><register id="IOMUX_QUAL_GRP_10_CFG_REG" acronym="IOMUX_QUAL_GRP_10_CFG_REG" offset="624" width="32" description="QUAL_GRP_10 config register.">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7:0" rwaccess="R/W"/>
	</register><register id="IOMUX_QUAL_GRP_11_CFG_REG" acronym="IOMUX_QUAL_GRP_11_CFG_REG" offset="628" width="32" description="QUAL_GRP_11 config register.">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7:0" rwaccess="R/W"/>
	</register><register id="IOMUX_QUAL_GRP_12_CFG_REG" acronym="IOMUX_QUAL_GRP_12_CFG_REG" offset="632" width="32" description="QUAL_GRP_12 config register.">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7:0" rwaccess="R/W"/>
	</register><register id="IOMUX_QUAL_GRP_13_CFG_REG" acronym="IOMUX_QUAL_GRP_13_CFG_REG" offset="636" width="32" description="QUAL_GRP_13 config register.">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7:0" rwaccess="R/W"/>
	</register><register id="IOMUX_QUAL_GRP_14_CFG_REG" acronym="IOMUX_QUAL_GRP_14_CFG_REG" offset="640" width="32" description="QUAL_GRP_14 config register.">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7:0" rwaccess="R/W"/>
	</register><register id="IOMUX_QUAL_GRP_15_CFG_REG" acronym="IOMUX_QUAL_GRP_15_CFG_REG" offset="644" width="32" description="QUAL_GRP_15 config register.">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7:0" rwaccess="R/W"/>
	</register><register id="IOMUX_QUAL_GRP_16_CFG_REG" acronym="IOMUX_QUAL_GRP_16_CFG_REG" offset="648" width="32" description="QUAL_GRP_16 config register.">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7:0" rwaccess="R/W"/>
	</register><register id="IOMUX_QUAL_GRP_17_CFG_REG" acronym="IOMUX_QUAL_GRP_17_CFG_REG" offset="652" width="32" description="QUAL_GRP_17 config register.">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7:0" rwaccess="R/W"/>
	</register><register id="IOMUX_USER_MODE_EN" acronym="IOMUX_USER_MODE_EN" offset="656" width="32" description="USER_MODE_EN config register.">
		<bitfield id="USER_MODE_EN" width="32" begin="31" end="0" resetval="0x0" description="Write 0XADADADAD to enable user mode write access to IO CFG space" range="31:0" rwaccess="R/W"/>
	</register><register id="IOMUX_PADGLBL_CFG_REG" acronym="IOMUX_PADGLBL_CFG_REG" offset="660" width="32" description="Global config register for IO.">
		<bitfield id="PADGLBL_CFG_REG" width="32" begin="31" end="0" resetval="0x0" description="20 : global_ie_n_ctl - Write 3'b111 to pass global_ie_n_val to IE_N/RXACTIVE_N pin of all the IOs.3 : global_ie_n_val - Active low108 : global_oe_n_ctl - Write 3'b111 to pass global_oe_n_val to OE_N/GZ pin of all the IOs.11 : global_oe_n_val - Active low1816 : global_pi_ctl - Write 3'b111 to pass global_pi_val and global_pu_val to all the IOs19 : global_pi_val20 : global_pu_val" range="31:0" rwaccess="R/W"/>
	</register><register id="IOMUX_IO_CFG_KICK0" acronym="IOMUX_IO_CFG_KICK0" offset="664" width="32" description="KICK0 config register.">
		<bitfield id="IO_CFG_KICK0" width="32" begin="31" end="0" resetval="0x0" description="Kicker 0 Register. The value 83E7 0B13h must be written to KICK0 as part of the process to unlock the CPU.write access to the above PIN MUX registers [including IOCFGKICK1]" range="31:0" rwaccess="R/W"/>
	</register><register id="IOMUX_IO_CFG_KICK1" acronym="IOMUX_IO_CFG_KICK1" offset="668" width="32" description="KICK1 config register.">
		<bitfield id="IO_CFG_KICK1" width="32" begin="31" end="0" resetval="0x193" description="Kicker 1 Register. The value 95A4 F1E0h must be written to the KICK1 as part of the process to unlock the CPU write access to above PINMUX registers [excluding IOCFGKICK0]. IOCFGKICK0 has to be written with 83E70B13h to enable access to IOCFGKICK1." range="31:0" rwaccess="R/W"/>
	</register>
</module>